Repository: ivanrenedo/nahsco-news
Catalog: locale/*/messages.po
Languages: es

source: Contact us
es: Contacta con nosotros

source: EG'S LEADING HIDROCARBONS SECTOR
es: EL PRINCIPAL CENTRO DE NOTICIAS SOBRE

source: EG's leading hydrocarbons sector news hub
es: El principal centro de noticias sobre el sector sobre hidrocarburos de G.E

source: English
es: Inglés

source: Events
es: Eventos

source: Jobs
es: Trabajos

source: Latest IOCs
es: Lo último en IOCs

source: Latest companies
es: Lo último

source: Latest events
es: Lo último en eventos

source: Latest jobs
es: Lo último en trabajos

source: Latest news
es: Lo último en noticias

source: Latest people
es: Lo último en gente

source: NEWS HUB
es: EL SECTOR DE HIDROCARBUROS DE G.E

source: News
es: Noticias

source: No results
es: Sin resultados

source: People
es: Gente

source: Popular news
es: Noticias populares

source: Published at
es: Publicado el

source: Search on nahsco news
es: Buscar en nahsco news

source: Service companies
es: Empresas de servicio

source: Share in
es: Compartir en

source: Spanish
es: Español

source: Website created by
es: Sitio web creado por

source: on IOCs
es: en IOCs

source: on event
es: en eventos

source: on jobs
es: en trabajos

source: on news
es: en noticias

source: on people
es: en gente

source: on service companies
es: en empresas de servicios
